{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input_layer_4": {"name": "input_layer_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_177_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_177_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_178_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_178_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_171_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_171_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_175_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_175_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_176_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_176_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_169_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_169_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_170_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_170_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_172_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_172_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_173_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_173_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_174_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_174_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_179_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_179_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_180_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_180_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_59_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_169_1/add", "op": "_FusedConv2D", "input": ["input_layer_4", "StatefulPartitionedCall/functional_14_1/conv2d_169_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_169_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-14"}, {"size": "-15"}, {"size": "-16"}, {"size": "-17"}]}, {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "16"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_115_1/Softplus", "op": "Softplus", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_169_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_115_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_14_1/activation_115_1/Softplus"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_115_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_169_1/add", "StatefulPartitionedCall/functional_14_1/activation_115_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_170_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/activation_115_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_170_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_170_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-20"}, {"size": "-21"}, {"size": "-22"}, {"size": "-23"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_116_1/Softplus", "op": "Softplus", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_170_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_116_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_14_1/activation_116_1/Softplus"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_116_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_170_1/add", "StatefulPartitionedCall/functional_14_1/activation_116_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_177_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/activation_116_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_177_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_177_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-24"}, {"size": "-25"}, {"size": "-26"}, {"size": "-27"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "1"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_171_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/activation_116_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_171_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_171_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-24"}, {"size": "-25"}, {"size": "-26"}, {"size": "-27"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_172_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/activation_116_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_172_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_172_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-24"}, {"size": "-25"}, {"size": "-26"}, {"size": "-27"}]}, {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_177_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_117_1/Softplus", "op": "Softplus", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_172_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_117_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_14_1/activation_117_1/Softplus"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice_2", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_117_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_172_1/add", "StatefulPartitionedCall/functional_14_1/activation_117_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/strided_slice", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/mul_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_173_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/activation_117_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_173_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_173_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-41"}, {"size": "-42"}, {"size": "-43"}, {"size": "-44"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose/input_sizes", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_177_1/add"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_178_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_173_1/add", "StatefulPartitionedCall/functional_14_1/conv2d_178_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_178_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-45"}, {"size": "-46"}, {"size": "-47"}, {"size": "-48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "1"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/max_pooling2d_14_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_173_1/add"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/conv_transpose", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_178_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_14_1/add_28_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_14_1/max_pooling2d_14_1/MaxPool2d", "StatefulPartitionedCall/functional_14_1/conv2d_171_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_174_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/max_pooling2d_14_1/MaxPool2d", "StatefulPartitionedCall/functional_14_1/conv2d_174_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_174_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-56"}, {"size": "-57"}, {"size": "-58"}, {"size": "-59"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "48"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_119_1/Softplus", "op": "Softplus", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_175_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/add_28_1/Add", "StatefulPartitionedCall/functional_14_1/conv2d_175_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_175_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-60"}, {"size": "-61"}, {"size": "-62"}, {"size": "-63"}]}, {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "48"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_119_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_14_1/activation_119_1/Softplus"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice_2", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_118_1/Softplus", "op": "Softplus", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_175_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_119_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_56_1/add", "StatefulPartitionedCall/functional_14_1/activation_119_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/strided_slice", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/mul_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_118_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_14_1/activation_118_1/Softplus"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_14_1/activation_119_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose/input_sizes", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_178_1/add"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_118_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_175_1/add", "StatefulPartitionedCall/functional_14_1/activation_118_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/conv_transpose", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_176_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/activation_118_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_176_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_176_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-64"}, {"size": "-65"}, {"size": "-66"}, {"size": "-67"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_120_1/Softplus", "op": "Softplus", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/add_29_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_176_1/add", "StatefulPartitionedCall/functional_14_1/conv2d_174_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_120_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_14_1/activation_120_1/Softplus"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_179_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_14_1/add_29_1/Add", "StatefulPartitionedCall/functional_14_1/conv2d_179_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_14_1/conv2d_179_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-70"}, {"size": "-71"}, {"size": "-72"}, {"size": "-73"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_14_1/activation_120_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_57_1/add", "StatefulPartitionedCall/functional_14_1/activation_120_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_179_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/functional_14_1/activation_120_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/Shape", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice_2", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/strided_slice", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/mul_1", "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_14_1/conv2d_transpose_58_1/conv_transpose/input_sizes", 